{"data":{"site":{"siteMetadata":{"title":"Portfolio","author":"Jesús Darío"}},"markdownRemark":{"id":"cca57700-6a39-56ce-8570-24a86cee0803","excerpt":"I decided to –finally– open a site about myself. I never really consider doing\nit. Partly because I thought it was best to let facts and projects speak by…","html":"<p>I decided to –finally– open a site about myself. I never really consider doing\nit. Partly because I thought it was best to let facts and projects speak by\nthemselves. However, as time passed by, I find it increasingly important to\nremind yourself about the things you have accomplish. With two objectives: (1) to\nserve as motivation to keep working in the things you love and (2) so those\nprojects are not forgotten, or are better taken care of.</p>\n<p>I chose to open a static site (using <a href=\"https://www.gatsbyjs.org/\">Gatsby</a>) because the following reasons:</p>\n<ul>\n<li>I am already familiar with the technology</li>\n<li>I find Markdown the best format to write posts in a minimal way</li>\n<li>Minimalism makes thing preserve in time, removing part of the fatigue of\nseeing the same things over and over</li>\n<li>A static site can be delivered in a very fast fashion by a number of free services</li>\n<li>It’s flexible enough to allow me play with low-level browser APIs and brind smalls samples of my past work to interactive pieces in this very site</li>\n</ul>\n<p>I have no interest in update this site super frequently, but rather when there\nis something that I want to share worth showcasing. I am a very eclectic person,\nso rather than publishing blog entries, I’ll keep <a href=\"https://medium.com/@jsdario\">Medium</a>\nas the platform where I write and develop ideas, and keep entries here simple\nenough to understand what has been done.</p>\n<p>Writing in English is not an easy decision. In Medium I have followers mainly\nfor the Engineering+Product content that I write in English or my essays and articles in Spanish. That way is very difficult to mantain a consistent publication strategy (and I don’t intend to), here I will have probably have less\nrestrictions so I will be able to keep pieces in whatever language I am more\ncomfortable writing for that topic. In <a href=\"https://twitter.com/jsdariorivera\">Twitter</a> I suffer the same dicotomy. Having this site will –all likely– allow me to definitely switch between both languages to only one in a hypothetical future where that decision matters at all.</p>\n<p>Funny enough, in English my words spread faster and further, but in Spanish my\nwords resonate deeper within the smaller network. This is all likely a “problem”\nshared by many authors and entrepreneurs in the digital era. I have no intention\nto choose, but if there is a preferred strategy, I’d probably choose deeper than\nwider.</p>\n<p>These words above about this site and its purpose are more for my future self\nthan for you; In any case, hope you find it interesting. I will use this way\nmy public voice to order my own thoughs.</p>\n<p>Thanks for reading</p>","frontmatter":{"title":"$ echo \"Hello World\"","date":"May 01, 2015"}}},"pageContext":{"slug":"/hello-world/","previous":null,"next":{"fields":{"slug":"/my-second-post/"},"frontmatter":{"title":"My Second Post!"}}}}